RIET/src/DataProcessors/rgsМониторСопровождения/rgsМониторСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>rgsМониторСопровождения</name>
  <comment>Обработка подключения к Монитору сопровождения, версия 2.0.5.7</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗакрытыеОтмененныеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИДТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТекстВопросаСЗадержкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновленияТекстаВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоМои</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПомощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПроектовИПользователей</name>
    <attributes>
      <name>НаименованиеПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СторонаПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСотрудникомПоддержки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаЗадач</name>
    <attributes>
      <name>ГУИДЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДВидаЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокСуществующихНастроек</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Настройки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/DataProcessors/rgsМониторСопровождения/Forms/ФормаОбсуждающиеИзменение/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьТаблицуПользователей()
	
	Попытка
		Определение = Новый WSОпределения(Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl", Объект.Пользователь, Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь = Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ТаблицаПользователейПоПроекту.Загрузить(ЗначениеИзСтрокиВнутр(Прокси.СписокПользователейПоПроекту(ГУИДПроекта)));
		// { RGS Лунякин Иван 11.11.2015 17:35:53 
		ТаблицаУчастниковОбсуждения = ЗначениеИзСтрокиВнутр(Прокси.ПолучитьТаблицуУчастниковОбсужденияВопроса (ГУИДВопроса));
		УчастникиОбсуждения.Загрузить(ПолучитьТехническуюСторонуПользователя(ТаблицаУчастниковОбсуждения));
		//УчастникиОбсуждения.Загрузить(ЗначениеИзСтрокиВнутр(Прокси.ПолучитьТаблицуУчастниковОбсужденияВопроса (ГУИДВопроса)));
		// } RGS Лунякин Иван 11.11.2015 17:35:53
		МассивПользователей = Новый Массив;
		Для Каждого Строка Из ТаблицаПользователейПоПроекту Цикл
			МассивПользователей.Добавить(Строка.ИмяПользователя);
		КонецЦикла;
		Элементы.ТаблицаПользователейИмяПользователя.СписокВыбора.ЗагрузитьЗначения(МассивПользователей);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
	КонецПопытки; 
	
КонецПроцедуры

// { RGS Лунякин Иван 11.11.2015 17:36:16

&НаСервере
Функция ПолучитьТехническуюСторонуПользователя(ТаблицаИсточник)
	 
	ТаблицаПриемник	= УчастникиОбсуждения.Выгрузить();
	ТаблицаПриемник.Очистить();
	
	Если ТаблицаИсточник.Количество() Тогда
	    Возврат(ЗаполнитьюСторонуПользователя(ТаблицаПриемник, ТаблицаИсточник));
	Иначе	
		Возврат(ТаблицаПриемник);
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ЗаполнитьюСторонуПользователя(ТаблицаПриемник, ТаблицаИсточник)
	Для каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника, , "СторонаПользователя");
		
		Если СтрокаТаблицыИсточника.СторонаПользователя = "Спрашивающий" Тогда
			СтрокаТаблицыПриемника.СторонаПользователя = НСтр("ru = 'Спрашивающий'; en = 'Requester'");
			СтрокаТаблицыПриемника.СторонаПользователяТехническая = СтрокаТаблицыИсточника.СторонаПользователя;
		ИначеЕсли СтрокаТаблицыИсточника.СторонаПользователя = "Отвечающий" Тогда
			СтрокаТаблицыПриемника.СторонаПользователя = НСтр("ru = 'Отвечающий'; en = 'Responsible'");
			СтрокаТаблицыПриемника.СторонаПользователяТехническая = СтрокаТаблицыИсточника.СторонаПользователя;
		ИначеЕсли СтрокаТаблицыИсточника.СторонаПользователя = "Сторонний наблюдатель" Тогда
			СтрокаТаблицыПриемника.СторонаПользователя = НСтр("ru = 'Сторонний наблюдатель'; en = 'Reviewer'");
			СтрокаТаблицыПриемника.СторонаПользователяТехническая = СтрокаТаблицыИсточника.СторонаПользователя;
		КонецЕсли; 
		
	КонецЦикла; 		  	
	Возврат ТаблицаПриемник;
КонецФункции 
// } RGS Лунякин Иван 11.11.2015 17:36:16   

&НаСервере
Процедура ОбновитьСоставОбсуждающихВВопросеСервер(Результат)
	
	Попытка
		Определение = Новый WSОпределения(Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl", Объект.Пользователь, Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь = Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ИсходящиеДанные = Новый Структура;
		ИсходящиеДанные.Вставить("УчастникиОбсуждения", ПереФормироватьТаблицуУчастникиОбсуждения());
		ИсходящиеДанные.Вставить("ГУИДВопроса", ГУИДВопроса);
		ИсходящиеДанныеСтрВн = ЗначениеВСтрокуВнутр(ИсходящиеДанные);
		Результат = Прокси.ОбновитьСоставПользователейВВопросе(ИсходящиеДанныеСтрВн);
	Исключение
		Результат = ОписаниеОшибки();
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция ПереФормироватьТаблицуУчастникиОбсуждения()
	
	ВременнаяТаблица = РеквизитФормыВЗначение("УчастникиОбсуждения");
	
	ВременнаяТаблица.Колонки.Удалить("СторонаПользователя");
	ВременнаяТаблица.Колонки.СторонаПользователяТехническая.Имя = "СторонаПользователя";
	
	Возврат ВременнаяТаблица;
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ГУИДПроекта = Параметры.ГУИДПроекта;
	ГУИДВопроса = Параметры.ГУИДВопроса;
	
	Объект.Пользователь = Параметры.Объект.Пользователь;
	Объект.Пароль		= Параметры.Объект.Пароль;
	Объект.АдресБазы 	= Параметры.Объект.АдресБазы;
	
	// { RGS Лунякин Иван 27.10.2015 12:51:08 
	Администратор 		= Параметры.Администратор;
	Элементы.ФормаИзменитьФорму.Видимость = Администратор;
	// } RGS Лунякин Иван 27.10.2015 12:51:08
	
	// { RGS Лунякин Иван 03.11.2015 16:29:30 
	ПолучитьНастройкиФормы();
	ЗаполнитьСписокВыбораСторонаПользователя();
	// } RGS Лунякин Иван 03.11.2015 16:29:30
	
	ЗаполнитьТаблицуПользователей();
	ПроставлениеТП();
	Если Параметры.Свойство("ИмяСобытия") Тогда
		ИмяСобытия = Параметры.ИмяСобытия;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСторонаПользователя()
	СписокВыбора = Элементы.ТаблицаПользователейСторонаПользователя.СписокВыбора;	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(НСтр("ru = 'Спрашивающий'; 			en = 'Requester'"));
	СписокВыбора.Добавить(НСтр("ru = 'Отвечающий'; 				en = 'Responsible'"));
	СписокВыбора.Добавить(НСтр("ru = 'Сторонний наблюдатель'; 	en = 'Reviewer'"));
КонецПроцедуры

// { RGS Лунякин Иван 03.11.2015 16:26:16

&НаСервере
Процедура ПолучитьНастройкиФормы()

	СтруктураНастроекФормы = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаФорм");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиФормы",,СтруктураНастроекФормы);
	КонецЕсли;
	СтруктураНастроекОкна = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаОкна");
	Если СтруктураНастроекФормы <> Неопределено Тогда
	   ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиОкна",,СтруктураНастроекОкна);
	КонецЕсли;

КонецПроцедуры

// } RGS Лунякин Иван 03.11.2015 16:26:16

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Неопределено;
	
	Если Модифицированность Тогда
		Если Не ПроверитьЗаполнениеПользователей(УчастникиОбсуждения, "УчастникиОбсуждения") Тогда
			Возврат;
		КонецЕсли;
		ОбновитьСоставОбсуждающихВВопросеСервер(Результат);
	КонецЕсли; 
	
	Если ИмяСобытия = "ОбсуждающиеИзменение" Тогда
		Оповестить("ОбсуждающиеИзменение", Результат, ЭтаФорма);
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
   
&НаКлиенте
// Проверка заполнения таблицы на клиенте.
// Параметры:
// Отказ  - параметр отказа,
// Таблица - таблица для проверки,
// НазваниеТаблицы - имя таблицы для проверки строкой. 
//
Функция ПроверитьЗаполнениеПользователей(Таблица, НазваниеТаблицы) 
	
	// Проверка незаполненных и повторяющихся пользователей.
	НомерСтроки = Таблица.Количество()-1;
	
	Пока  НомерСтроки >= 0 Цикл
		ТекущаяСтрока = Таблица.Получить(НомерСтроки);
		// Проверка заполнения значения.
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ИмяПользователя) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнен пользователь!'; en = 'Do not fill the user !'");
			Сообщение.Поле = НазваниеТаблицы + "[" + Формат(НомерСтроки, "ЧГ=0") + "].ИмяПользователя";
			Сообщение.Сообщить(); 
			Возврат Ложь;
		КонецЕсли;

		// Проверка наличия повторяющихся значений.
		НайденныеЗначения = Таблица.НайтиСтроки(Новый Структура("ИмяПользователя, СторонаПользователя", ТекущаяСтрока.ИмяПользователя, ТекущаяСтрока.СторонаПользователя));
		Если НайденныеЗначения.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Пользователь повторяется!'; en = 'The user repeats!'");
			Сообщение.Поле = НазваниеТаблицы + "["  + Формат(НомерСтроки, "ЧГ=0") + "].ИмяПользователя";
			Сообщение.Сообщить(); 
			Возврат Ложь;
		КонецЕсли;
		НомерСтроки = НомерСтроки - 1;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура ТаблицаПользователейИмяПользователяНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЭлСписка Из ТаблицаПользователейПоПроекту Цикл
		Элемент.СписокВыбора.Добавить(ЭлСписка.ИмяПользователя, ЭлСписка.ИмяПользователя);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователейИмяПользователяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Массив = ТаблицаПользователейПоПроекту.НайтиСтроки(Новый Структура("ИмяПользователя", ВыбранноеЗначение));
	Если Массив.Количество()>0 Тогда
		Элементы.ТаблицаПользователей.ТекущиеДанные.ГУИДПользователя = Массив[0].ГУИДПользователя;
	КонецЕсли; 
 	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.ТаблицаПользователей.ТекущиеДанные.СторонаПользователя = НСтр("ru = 'Отвечающий'; en = 'Responsible'");
		ЗаполнитьТехническуюСторонуПользователя();
	КонецЕсли; 	
    	
   	Модифицированность = Истина;
	
КонецПроцедуры

// { RGS Лунякин Иван 12.11.2015 14:48:21

&НаКлиенте
Процедура ЗаполнитьТехническуюСторонуПользователя()
	
	ТекущаяСтрока = Элементы.ТаблицаПользователей.ТекущиеДанные;
	
	Если ТекущаяСтрока.СторонаПользователя = НСтр("ru = 'Спрашивающий'; en = 'Requester'") Тогда
		
		ТекущаяСтрока.СторонаПользователяТехническая = "Спрашивающий";
		
	ИначеЕсли ТекущаяСтрока.СторонаПользователя = НСтр("ru = 'Отвечающий'; en = 'Responsible'") Тогда
		
		ТекущаяСтрока.СторонаПользователяТехническая = "Отвечающий";
		
	ИначеЕсли ТекущаяСтрока.СторонаПользователя = НСтр("ru = 'Сторонний наблюдатель'; en = 'Reviewer'") Тогда
		
		ТекущаяСтрока.СторонаПользователяТехническая = "Сторонний наблюдатель";
		
	КонецЕсли;
	
КонецПроцедуры
// } RGS Лунякин Иван 12.11.2015 14:48:21   

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователейПослеУдаления(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Модифицированность = Истина;
   		
КонецПроцедуры

&НаСервере
Процедура ПроставлениеТП()

	Для каждого Строка Из УчастникиОбсуждения Цикл
	    Пар = Новый Структура();
		Пар.Вставить("ИмяПользователя", Строка.ИмяПользователя);
		СтрокаПроектов = ТаблицаПользователейПоПроекту.НайтиСтроки(Пар);
		Если СтрокаПроектов.Количество() = 1 Тогда
			Строка.ЯвляетсяСотрудникомПоддержки = СтрокаПроектов[0].ЯвляетсяСотрудникомПоддержки;
		КонецЕсли;	
	КонецЦикла; 	

КонецПроцедуры 


&НаКлиенте
Процедура ТаблицаПользователейПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаПользователей.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		 Пар = Новый Структура();
		Пар.Вставить("ИмяПользователя", ТекДанные.ИмяПользователя);
		СтрокаПроектов = ТаблицаПользователейПоПроекту.НайтиСтроки(Пар);
		Если СтрокаПроектов.Количество() = 1 Тогда
			ТекДанные.ЯвляетсяСотрудникомПоддержки = СтрокаПроектов[0].ЯвляетсяСотрудникомПоддержки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрокси(Определение) Экспорт
	
	Возврат Новый WSПрокси (Определение, "RemoteConnect", "RemoteConnect", "RemoteConnectSoap");
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователейСторонаПользователяПриИзменении(Элемент)
	ЗаполнитьТехническуюСторонуПользователя();
КонецПроцедуры
